
	id division.
	program-id.  cob2.
	
	environment division.

	data division.

	procedure division.
		display 'hello'  with no advancing.
		display 'world'.
		stop run.