      ** 程式範例十-3 (SAM10-3.CBL)
      ** 利用REDEFINES子句及二維表格

        IDENTIFICATION  DIVISION.
        PROGRAM-ID.     Sample10-3.
      **
        ENVIRONMENT     DIVISION.
        CONFIGURATION   SECTION.
        SOURCE-COMPUTER. IBM-PC.
        OBJECT-COMPUTER. IBM-PC.
      **
        DATA    DIVISION.
        WORKING-STORAGE SECTION.
        77 I        PIC 99.
        77 J        PIC 99.
        77 ANS      PIC X.
        77 FUNC-KEY PIC 99.
        77 SALARY   PIC $$$,$$$.
        01 TABLE1.
           05 FILLER PIC X(25)  VALUE "0600007000080000900000000".
           05 FILLER PIC X(25)  VALUE "0700008000090001000011000".
           05 FILLER PIC X(25)  VALUE "0800009000100001100012000".
           05 FILLER PIC X(25)  VALUE "1000012000140001600018000".
           05 FILLER PIC X(25)  VALUE "1200014000160001800020000".
           05 FILLER PIC X(25)  VALUE "1400016000180002000022000".
           05 FILLER PIC X(25)  VALUE "1600019000220002500028000".
           05 FILLER PIC X(25)  VALUE "1900022000250002800031000".
           05 FILLER PIC X(25)  VALUE "2200025000280003100034000".
           05 FILLER PIC X(25)  VALUE "2600030000340003800042000".
        01 TABLE2  REDEFINES  TABLE1.
           05 AA  OCCURS  10 TIMES.
              10 MONTH-SALARY  OCCURS  5 TIMES   PIC 9(5).
      **
        PROCEDURE       DIVISION.
        000-MAIN-RTN.
            DISPLAY " " LINE 1 POSITION 1 ERASE.
            PERFORM 100-LOOP UNTIL FUNC-KEY = 27.
            STOP RUN.
        100-LOOP.
            DISPLAY "欲查詢的職級 : " LINE 10 POSITION 15.
            DISPLAY "        職等 : " LINE 11 POSITION 15.
            DISPLAY "此職務的月薪所得 : " LINE 13 POSITION 15.
            ACCEPT I LINE 10 POSITION 32.
            ACCEPT J LINE 11 POSITION 32.
            MOVE MONTH-SALARY (I, J) TO SALARY.
            DISPLAY SALARY LINE 13 POSITION 35.
            DISPLAY "[ESC]跳離 ; 其他鍵繼續" LINE 18 POSITION 30.
            ACCEPT ANS LINE 18 POSITION 54
                       ON EXCEPTION FUNC-KEY NEXT SENTENCE.
