000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.  PJNAME.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 AREANAME.
000070   02 AREA1 PIC 99.
000080   02 AREA2 PIC XX.
000090   02 AREA3 PIC 99.
000100 PROCEDURE DIVISION.
000110 MAIN-PROCESS.
000120     ACCEPT AREANAME.
000130     DISPLAY  AREA1.
000140     STOP RUN.
000150 END PROGRAM  PJNAME.
